#!/usr/bin/env bash
# **********************************************************************************************************************
# 开发环境 docker 启动
# **********************************************************************************************************************

git pull

# 卸载容器
docker-compose down

# 清理悬挂镜像
docker image prune -f

#docker-compose -f ~/docker/redis/docker-compose.yml up -d
#export IMAGE_TAG=`date +"%Y%m%d%H%M"`

mvn clean package -P dev -D maven.test.skip=true

docker-compose up -d --build










#cd app-demo && bash dev-docker.sh                 # 更新 app-demo

#echo '
## **********************************************************************************************************************
## 单个服务更新脚本整理
## **********************************************************************************************************************
##cd app-demo && bash dev-docker.sh && cd ..                     # 更新 app-demo 网关，包含跨域环境
#
## **********************************************************************************************************************
## 查看日志
## **********************************************************************************************************************
#tail -F ~/docker/logs/*.log                   # 滚动查看全部日志
#tail -F ~/docker/logs/demo.log                # 应用服务日志
#'
